<%--
  Created by IntelliJ IDEA.
  User: dky
  Date: 2022/4/24
  Time: 下午1:26
  To change this template use File | Settings | File Templates.
--%>
<%@ page contentType="text/html;charset=UTF-8" language="java" %>
<html>
<head>
    <title>登高</title>
    <style type="text/css">
        *{margin:0;padding:0}
        .outer-wrap{
            height: 100%;
            position: relative;
        }
        html{
            width: 100%;
            height: 100%;
            overflow: hidden;
            font-style: sans-serif;
        }
        body{
            width: 100%;
            height: 100%;
            font-family: 'Open Sans',sans-serif;
            margin: 0;
            background-image: url(./images/background.jpg);
            background-position: center center;
            background-repeat: no-repeat;
            background-attachment: fixed;
            background-size: cover;
            background-color: #fff;
        }
        #jz{ margin:0 auto; width:60%; height:100%;overflow: auto;color:#fff;border:2px solid #fff;font-size: 15pt;}
    </style>
</head>
<body>
<div id="jz">
    此诗选自《杜工部集》，是杜甫公元767年（大历二年）秋在夔州时所写。夔州在长江之滨。全诗通过登高所见秋江景色，倾诉了诗人长年漂泊、老病孤愁的复杂感情，慷慨激越、动人心弦。杨伦称赞此诗为“杜集七言律诗第一”（《杜诗镜铨》），胡应麟《诗薮》更推重此诗精光万丈，是古今七言律诗之冠。<br>
    此诗前四句写登高见闻。首联对起。诗人围绕夔州的特定环境，用“风急”二字带动全联，一开头就写成了千古流传的佳句。夔州向以猿多著称，峡口更以风大闻名。秋日天高气爽，这里却猎猎多风。诗人登上高处，峡中不断传来“高猿长啸”之声，大有“空谷传响，哀转久绝”（《水经注·江水》）的意味。诗人移动视线，由高处转向江水洲渚，在水清沙白的背景上，点缀着迎风飞翔、不住回旋的鸟群，真是一幅精美的画图。其中天、风，沙、渚，猿啸、鸟飞，天造地设，自然成对。不仅上下两句对，而且还有句中自对，如上句“天”对“风”，“高”对“急”；下句“沙”对“渚”，“白”对“清”，读来富有节奏感。经过诗人的艺术提炼，十四个字，字字精当，无一虚设，用字遣辞，“尽谢斧凿”，达到了奇妙难名的境界。更值得注意的是：对起的首句，末字常用仄声，此诗却用平声入韵。沈德潜因有“起二句对举之中仍复用韵，格奇而变”（《唐诗别裁》）的赞语。<br>
    颔联集中表现了夔州秋天的典型特征。诗人仰望茫无边际、萧萧而下的木叶，俯视奔流不息、滚滚而来的江水，在写景的同时，便深沉地抒发了自己的情怀。“无边”“不尽”，使“萧萧”“滚滚”更加形象化，不仅使人联想到落木窸窣之声，长江汹涌之状，也无形中传达出韶光易逝，壮志难酬的感怆。透过沉郁悲凉的对句，显示出神入化之笔力，确有“建瓴走阪”、“百川东注”的磅礴气势。前人把它誉为“古今独步”的“句中化境”，是有道理的。<br>
    前两联极力描写秋景，直到颈联，才点出一个“秋”字。“独登台”，则表明诗人是在高处远眺，这就把眼前景和心中情紧密地联系在一起了。“常作客”，指出了诗人飘泊无定的生涯。“百年”，本喻有限的人生，此处专指暮年。“悲秋”两字写得沉痛。秋天不一定可悲，只是诗人目睹苍凉恢廓的秋景，不由想到自己沦落他乡、年老多病的处境，故生出无限悲愁之绪。诗人把旧客最易悲愁，多病独爱登台的感情，概括进一联“雄阔高浑，实大声弘”的对句之中，使人深深地感到了他那沉重地跳动着的感情脉搏。此联的“万里”“百年”和上一联的“无边”“不尽”，还有相互呼应的作用：诗人的羁旅愁与孤独感，就象落叶和江水一样，推排不尽，驱赶不绝，情与景交融相洽。诗到此已给作客思乡的一般含意，添上久客孤独的内容，增入悲秋苦病的情思，加进离乡万里、人在暮年的感叹，诗意就更见深沉了。<br>
    尾联对结，并分承五六两句。诗人备尝艰难潦倒之苦，国难家愁，使自己白发日多，再加上因病断酒，悲愁就更难排遣。本来兴会盎然地登高望远，此时却平白无故地惹恨添悲，诗人的矛盾心情是容易理解的。前六句“飞扬震动”，到此处“软冷收之，而无限悲凉之意，溢于言外”（《诗薮》）。<br>
    诗前半写景，后半抒情，在写法上各有错综之妙。首联着重刻画眼前具体景物，好比画家的工笔，形、声、色、态，一一得到表现。次联着重渲染整个秋天气氛，好比画家的写意，只宜传神会意，让读者用想象补充。三联表现感情，从纵（时间）、横（空间）两方面着笔，由异乡飘泊写到多病残生。四联又从白发日多，护病断饮，归结到时世艰难是潦倒不堪的根源。这样，杜甫忧国伤时的情操，便跃然纸上。<br>
    此诗八句皆对。粗略一看，首尾好像“未尝有对”，胸腹好象“无意于对”。仔细玩味，“一篇之中，句句皆律，一句之中，字字皆律”。不只“全篇可法”，而且“用句用字”，“皆古今人必不敢道，决不能道者”。它能博得“旷代之作”（均见胡应麟《诗薮》）的盛誉，就是理所当然的了。<br>
    风急天高猿啸哀，渚清沙白鸟飞回。<br>
    天高风急，秋气肃杀，猿啼哀啸，十分悲凉；清清河洲，白白沙岸，鸥鹭低空回翔。首联两句，对举之中仍复用韵，且句中自对，无一虚设。这是诗人登高看到的景象，构成一幅悲凉的秋景图画，为全诗定下了基调。登高而望，江天本来是开阔的，但在诗人笔下，却令人强烈地感受到：风之凄急、猿之哀鸣、鸟之回旋，都受着无形的秋气的控制，仿佛万物都对秋气的来临惶然无主。“风急”，夔州位于长江之滨，三峡之首的瞿塘峡之口，素以水急、风大著称。“猿啸哀”，巫峡多猿，鸣声凄厉。当地民谣说：“巴东三峡巫峡长，猿鸣三声泪沾裳。”“渚”，水中的小块陆地。<br>
    无边落木萧萧下，不尽长江滚滚来。<br>
    落叶飘零，无边无际，纷纷扬扬，萧萧而下；奔流不尽的长江，汹涌澎湃，滚滚奔腾而来。颔联为千古名句，写秋天肃穆萧杀、空旷辽阔的景色，一句仰视，一句俯视，有疏宕之气。“无边”，放大了落叶的阵势，“萧萧下”，又加快了飘落的速度。在写景的同时，深沉地抒发了自己的情怀，传达出韶光易逝，壮志难酬的感怆。它的境界非常壮阔，对人们的触动不限于岁暮的感伤，同时让人想到生命的消逝与有限，宇宙的无穷与永恒。透过沉郁悲凉的精工对句，显示着诗人出神入化的笔力，有“建瓴走阪”、“百川东注”的磅礴气势。前人誉为“古今独步”的“句中化境”。<br>
    万里悲秋常作客，百年多病独登台。<br>
    我万里漂泊，常年客居他乡，对此秋景，更觉伤悲；有生以来，疾病缠身，今日独自登临高台。颈联是诗人一生颠沛流离生活的高度概括，有顿挫之神。诗人从空间（万里）、时间（百年）两方面着笔，把久客最易悲秋，多病独自登台的感情，融入一联雄阔高浑的对句之中，情景交融，使人深深地感到他那沉重的感情脉搏。语言极为凝链，乃千古名句。宋代学者罗大经《鹤林玉露》析此联云：“万里，地之远也；悲秋，时之惨凄也；作客，羁旅也；常作客，久旅也；百年，暮齿也；多病，衰疾也；台，高迥处也；独登台，无亲朋也；十四字之间含有八意，而对偶又极精确。”“八意”，即八可悲：他乡作客，一可悲；常作客，二可悲；万里作客，三可悲；又当萧瑟的秋天，四可悲；年已暮齿，一事无成，五可悲；亲朋亡散，六可悲；孤零零的独自去登，七可悲；身患疾病，八可悲。<br>
    艰难苦恨繁霜鬓，潦倒新停浊酒杯。<br>
    时世艰难，生活困苦，我常恨鬓如霜白；浊酒销忧，却怎奈潦倒，以至需要停杯。尾联转入对个人身边琐事的悲叹，与开篇《楚辞》般的天地雄浑之境，形成惨烈的对比。“苦恨”，甚恨，意思是愁恨很深。“潦倒”，犹言困顿衰颓，狼狈失意。新停浊酒杯：一般解释为戒酒，不妥。“停”是表示某种动作状态延续途中的一时中断，这一句是说，我一人登台，独饮浊酒，无亲朋相伴，慢慢举起销忧解愁的酒杯，停在嘴边——我的身体已承受不了啦，至今饮酒不断、未曾有过停杯体验的我，不禁为自己身心之衰感到愕然。新，指初次出现。“浊酒”是相对于“清酒”而言，是一种带糟的酒，就像今天的米酒，古时称之为“醪”。
</div>
</body>
</html>
