<%--
  Created by IntelliJ IDEA.
  User: dky
  Date: 2022/4/24
  Time: 下午1:25
  To change this template use File | Settings | File Templates.
--%>
<%@ page contentType="text/html;charset=UTF-8" language="java" %>
<html>
<head>
    <title>春江花月夜</title>
    <style type="text/css">
        *{margin:0;padding:0}
        .outer-wrap{
            height: 100%;
            position: relative;
        }
        html{
            width: 100%;
            height: 100%;
            overflow: hidden;
            font-style: sans-serif;
        }
        body{
            width: 100%;
            height: 100%;
            font-family: 'Open Sans',sans-serif;
            margin: 0;
            background-image: url(./images/background.jpg);
            background-position: center center;
            background-repeat: no-repeat;
            background-attachment: fixed;
            background-size: cover;
            background-color: #fff;
        }
        #jz{ margin:0 auto; width:60%; height:100%;overflow: auto;color:#fff;border:2px solid #fff;font-size: 15pt;}
    </style>
</head>
<body>
<div id="jz">
    诗篇题目就令人心驰神往。春、江、花、月、夜，这五种事物集中体现了人生最动人的良辰美景，构成了诱人探寻的奇妙艺术境界。<br>
    <br>
    　　以“孤篇横绝，竟为大家。” (《论唐诗诸家源流》) 的张若虚，千百年来正如他的名字一样若隐若现地在唐诗的星河中闪烁着别具一格的光芒，他仅存的两首诗歌之一《春江花月夜》以真挚的离情、睿智的哲理、优美的语言、幽雅的韵律、神韵的境界使读者折腰，以其独特的艺术魅力技压群芳，丰富的艺术生命力和感染力流传千古。《春江花月夜》是乐府《清商曲辞·吴声歌曲》旧题。诗篇题目的春、江、花、月、夜五个诗歌意象，它们之间唇齿相依的关系有机地构成了一个魅力的艺术境界。<br>
    　　这首诗歌以月为线索，以春、江、花、月、夜为明珠的链式结构，是很明显的。更何况清代的徐增在《而庵说唐诗》中早已阐述：“起用出生法，将春、江、花、月逐字吐出；结用归消法，又将春、江、花、月逐字收拾……此诗如连环锁子骨，节节相生，绵绵不断，使读者眼光正射不得，斜射不得，无处寻其端绪。‘春江花月夜’五个字，各各照顾有情。”由此可见，月在全诗中犹如一条生命纽带，通贯上下，触处生神。月在一夜之间：升起——高悬——西斜——落下。这蕴含的人生哲理是不言自明的。全诗共三十六句，四句一换韵，共换了九韵。庚韵——霰韵——真韵——纸韵——尤韵——灰韵——文韵——麻韵——遇韵。前呼后应地切合诗情的起伏让五种诗歌的意象丝丝入扣，和谐地构建诗歌的意境美。张若虚的《春江花月夜》其实就是一首回环往复的《爱情小夜曲》。<br>
    　　春江潮水连海平，海上明月共潮生。滟滟随波千万里，何处春江无月明。<br>
    <br>
    　　这美丽的画卷一打开：江潮连海，月共潮生。意象阔朗明丽、清新出尘、神秘朦胧、气势宏伟。一轮明月从春江上冉冉升起，不禁让人遐想联翩，一个“生”字赋予明月与潮水生命的活力。<br>
    　　江流宛转绕芳甸，月照花林皆似霰。空里流霜不觉飞，汀上白沙看不见。<br>
    <br>
    　　诗人的丹青妙手轻轻点染出春江月夜中的奇异之“花”，巧妙地接引出“春江花月夜”的题面。月光精致地将大千世界浸染成梦幻般的银辉色，巧妙地创造了一个神话般幽美恬静境界。<br>
    　　江天一色无纤尘，皎皎空中孤月轮。江畔何人初见月？江月何年初照人？<br>
    <br>
    　　清明的宇宙，人生的哲理。即：永恒——短暂，时空无限，生命有限，诗人的心灵与自然有了一种神性的交流。充分体现了中国诗人所特有的“宇宙意识”。<br>
    　　人生代代无穷已，江月年年只相似。不知江月待何人，但见长江送流水。<br>
    <br>
    　　张若虚别开生面的翻陈出新，轻巧地把诗歌的基调定在“哀而不伤”的境界。宇宙永恒，江月常在，人代代相传。自然地由景到人，蕴含深意。又巧妙引出下文男女相思的离愁别恨之情。<br>
    　　白云一片去悠悠，青枫浦上不胜愁。谁家今夜扁舟子，何处相思明月楼？<br>
    <br>
    　　白云、青枫浦等托物寓情，明静的诗境中融入了哀伤，可谓是一种相思两地离愁，回环往复，诗情荡漾，曲折有致。诗人以飘泊无定的愁心来想象“扁舟子”而思家念妻，意蕴深广，情韵悠扬。<br>
    　　可怜楼上月徘徊，应照离人妆镜台。玉户帘中卷不去，捣衣砧上拂还来。<br>
    <br>
    　　这几句诗很巧，诗人没写自己的思念而写想象中的爱之人如何思念自己，对思妇的怜爱和歉疚溢于言表，这种深情是多么感人，多么投入，多么执着，既肯定了生存价值也体现了生命意志。<br>
    　　昨夜闲潭梦落花，可怜春半不还家。江水流春去欲尽，江潭落月复西斜。<br>
    <br>
    　　家，是最令人情思摇曳的向往与归宿，以春、江、花、月、夜点染烘托，想象中的实境中蕴含着梦境，这样的时空叠合、虚实相间、婉转悱恻的写法真的是达到了“言有尽而意无穷”的艺术效果。<br>
    　　斜月沉沉藏海雾，碣石潇湘无限路。不知乘月几人归，落月摇情满江树。<br>
    <br>
    　　诗人羡慕月夜回家的游子，想象中温暖的家园，诗歌以写景结束，景中含情。“落月摇情满江树”一句作结笔，可以说既是写月落亦是说同情。让诗情、画意、哲理三者共同塑造出一个空灵邈远的魅力意境。<br>
    <br>
    　　张若虚的《春江花月夜》是诗中诗，画中画的上品之作，有机地将诗情、画意、哲理融汇于一炉，使所有的意象、物象、情态连为一体。诗人依次有序地描绘月光笼罩的潮水、波光、江流、芳甸、花林、白沙、夜空、白云、青枫、闺楼、镜台、江树等富有诗意的景象，宛如一幅淡雅淋漓的水墨长轴画卷，月亮是轴心，是神魂。并且，按照时间先后来布局谋篇、安排诗歌的结构：明月初升 (海上明月共潮生) ——月到中天(皎皎空中孤月轮)——月亮西移(可怜楼上月徘徊)——月落西山(斜月沉沉藏海雾)。<br>
    　　我国传统美学中，对情的强调是一贯的。如《毛诗序》中说：“情动于中而形于言”。对于诗歌而言，情感是诗歌的本质，张若虚的深情也是《春》诗的魅力之所在。他笔下的月是情爱的意象，是一种表达情与爱的最佳寄寓和祝愿，是对人类精神的不懈追求。月亮本是古代诗词中司空见惯的主题，但作者写来却别有风味，体现了诗人对生命意义的切身感悟和对“天人合一”这一哲学思想的深刻认识。可见，这首诗歌在思想与艺术上是超然的，它把“羡宇宙之无穷，哀吾生之须臾”的哲理有机地融入了诗情画意之中，围绕春、江、花、月、夜五个诗歌意象逐层铺展，清丽而幽美， 柔婉而酣畅，宽泛而轻淡，真切而缠绵，就好似三月的雨丝缓缓地沁人心扉，弥漫着“润物细无声”的艺术魅力，把大自然之景与诗人感悟之情浑然于一体，从而创造了一个哲思睿智、恬淡豁达、寥廓悠远、虚静深邃的艺术境界。
</div>
</body>
</html>

